README.md
```mermaid
graph LR
  subgraph To NATS
    direction LR
    PT(Polling Trigger) --> SC1(Service Collection)
    SC1 --> NP(NATS Producer)
  end
  NP --> NS[NATS Server]
  subgraph NATS To FS
    direction LR
    NS --> NC(NATS Consumer)
    NC --> SC2(Service Collection)
    SC2 --> FP(FS Producer)
  end
```
